# 초당 최대 처리량은 요청의 응답 완료 여부에 
# 관계없이 임의 시간부터 1초(=1,000밀리초)간 
# 처리하는 요청의 최대 개수

def solution(lines):
    answer = 0
    dict = {}

    for line in lines : 
        date, time, inter = line.split()
        inter = float("".join(list(inter)[0:len(inter)-1]))
        h,m,n = map(float, time.split(":"))

        endtime = h*3600 + m*60 + n
        starttime = endtime - inter + 0.001

        print(starttime, endtime)
        # 일단 시작시간, 끝시간만 구해놓은 상황이지 
    return answer

# print(solution( [
# "2016-09-15 01:00:04.001 2.0s",
# "2016-09-15 01:00:07.000 2s"
# ]
# ))

print(solution( [
"2016-09-15 01:00:04.002 2.0s",
"2016-09-15 01:00:07.000 2s"
]
))

# print(solution( [
# "2016-09-15 20:59:57.421 0.351s",
# "2016-09-15 20:59:58.233 1.181s",
# "2016-09-15 20:59:58.299 0.8s",
# "2016-09-15 20:59:58.688 1.041s",
# "2016-09-15 20:59:59.591 1.412s",
# "2016-09-15 21:00:00.464 1.466s",
# "2016-09-15 21:00:00.741 1.581s",
# "2016-09-15 21:00:00.748 2.31s",
# "2016-09-15 21:00:00.966 0.381s",
# "2016-09-15 21:00:02.066 2.62s"
# ]))
